Table of Contents
 Interface IIdeaBoltGrid
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Represent bolt grid
public interface IIdeaBoltGrid : IIdeaPersistentObject, IIdeaObject
Inherited Members
 IIdeaPersistentObject.Token
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 BoltAssembly
Bolt Assembly
IIdeaBoltAssembly BoltAssembly { get; }
Property Value
IIdeaBoltAssembly
 BoltShearType
Defines a transfer of shear force in bolts.
BoltShearType BoltShearType { get; }
Property Value
BoltShearType
 ConnectedParts
Collection of parf witch shoud be bolted
IEnumerable<IIdeaObjectConnectable> ConnectedParts { get; }
Property Value
IEnumerable<IIdeaObjectConnectable>
 LocalCoordinateSystem
Local Coordinate System (LCS) of the bolt grid. Only vector definition of the LCS is supported, so the instance of CoordSystemByVector must be returned. LCS only effects rotation of the segment, it does not modify on nodes' position.
CoordSystem LocalCoordinateSystem { get; }
Property Value
CoordSystem
 Origin
Origin node of the bolt grid.
IIdeaNode Origin { get; }
Property Value
IIdeaNode
 Positions
Collection of nodes specific position of the bolt
IEnumerable<IIdeaNode> Positions { get; }
Property Value
IEnumerable<IIdeaNode>
 ShearInThread
Shear in thread
bool ShearInThread { get; }
Property Value
bool
 Edit this page